import math

def circle_area(r):
    return math.pi * (r ** 2)
    '''
    Вычисляет площадь круга радиуса r.

        Параметры:
                r(float): радиус круга;
        Возращаемое значение:
            circle_square (float): десятичное число, результат умножения r*r на число, равное отношению длины окружности к диаметру.
    '''

def circle_perimeter(r):
    return 2 * math.pi * r
    '''
    Вычисляет периметр круга радиуса r.

        Параметры:
                r(float): радиус круга;
        Возращаемое значение:
            circle_perimeter (float): десятичное число, результат умножения 2*r на число, равное отношению длины окружности к диаметру.
    '''
    
