def area(a, b):
    '''
    Возвращает площадь прямоугольника.

        Параметры:
            a (int): длина прямоугольника
            b (int): ширина прямоугольника
        
        Возвращаемое значение:
            a * b (int): искомая площадь прямоугольника.
    '''
    return a * b
def perimeter(a, b):
     '''
    Возвращает периметр прямоугольника.

        Параметры:
            a (int): длина прямоугольника
            b (int): ширина прямоугольника
        
        Возвращаемое значение:
            2*(a + b) (int): искомый периметр прямоугольника.
    '''
    return 2*(a + b)