def area(a, b):
    '''
    Возвращает площадь прямоугольника со сторонами a, b

        Параметры:
            a (float): длина прямоугольника
            b (float): ширина прямоугольника

        Возвращаемое значение:
            (float): значение площади прямоугольника
    '''
    return a * b

def perimetr(a, b):
    '''
    Возвращает периметр прямоугольника со сторонами a, b

        Параметры:
            a (float): длина прямоугольника
            b (float): ширина прямоугольника

        Возвращаемое значение:
            (float): значение периметра прямоугольника
    '''
    return (a + b) * 2

