def area(a,b):
    '''
    Принимает два числа a,b (a > 0, b > 0).
    Возвращает площадь прямоугольника со сторонами a и b.

    a: первая сторона прямоугольника, положительное число
    b: вторая сторона прямоугольника, положительное число

    '''
    return a*b


def perimeter(a,b):
    '''
        Принимает два числа a,b (a > 0, b > 0).
        Возвращает периметр прямоугольника со сторонами a и b.

        a: первая сторона прямоугольника, положительное число
        b: вторая сторона прямоугольника, положительное число

        '''
    return (a+b)*2
