
def rectangle_area(a, b): 
    return a * b
    '''
    Вычисляет площадь прямоугольника с длиной a и шириной b.

            Параметры:
                    a (float): длина прямоугольника;
                    b (float): ширина прямоугольника; 

            Возращаемое значение:
                    rectangle_square (float): десятичное число, результат умножения a*b;
    '''


def rectangle_perimeter(a, b):
    return (a + b) * 2
    '''
    Вычисляет периметр прямоугльника длиной a и шириной b.

            Параметры:
                    a (float): длина прямоугольника;
                    b (float): ширина прямоугольника;

            Возращаемое значение:
                    rectangle_perimeter (float): десятичное число, результат умножения (a + b) * 2;
    '''
