
def area(a, b):
    ''' Находит площадь прямоугольника
            Параметры:
                a (double): первая сторона
                b (double): вторая сторона
            Возвращаемые значения:
                area (double): площадь прямоугольника
            Пример вызова функции: area(5, 15) = 75
    '''
    return a * b


def perimeter(a, b):
    ''' Находит периметр прямоугольника
            Параметры:
                a (double): первая сторона
                b (double): вторая сторона
            Возвращаемые значения:
                perimeter (double): периметр прямоугольника
            Пример вызова функции: perimeter(5, 15) = 40
    '''
    return (a + b) * 2
