def area(a, b):
    '''
    Функция для вычисления площади прямоугольника:
        Параметры:
            a (int) - длина стороны прямоугольника
            b (int) - длина другой стороны треугольника
        Возвращаемое значение:
            a*b - площадь треугольника 
    ''' 
    return a * b 

def perimeter(a, b):
    '''
    Функция для вычисления периметра прямоугольника:
        Параметры:
            a (int) - длина стороны прямоугольника
            b (int) - длина другой стороны треугольника
        Возвращаемое значение:
            2*(a+b) - периметр треугольника 
    ''' 


    return 2*(a + b) 
