def area(a, b): 
    '''Возвращает площадь прямоугольника со сторонами a и b
        Параметры:
            a (int): длина одной стороны прямоугольника
            b (int): длина соседней стороны
        Возвращаемое значение:
            area (int): площадь искомого прямоугольника
    '''
    return a * b 
def perimeter(a, b): 
    '''Возвращает периметр прямоугольника со сторонами a и b
        Параметры:
            a (int): длина одной стороны прямоугольника
            b (int): длина соседней стороны
        Возвращаемое значение:
            peimeter (int): периметр искомого прямоугольника
    '''
    return (a + b)*2 
