def area(a, b):
    '''
    Возвращает площадь прямоугольника.

        Параметры:
            a (float) : первая сторона прямоугольника
            b (float) : вторая сторона прямоугольника

        Возвращаемое значение:
            S (float) : площадь прямоугольника
    '''
    S = a * b
    return S 

def perimeter(a, b):
    '''
    Возвращает площадь прямоугольника.

        Параметры:
            a (float) : первая сторона прямоугольника
            b (float) : вторая сторона прямоугольника

        Возвращаемое значение:
            P (float) : периметр прямоугольника
    '''
    P = (a + b) * 2 
    return P
