def area(a):
    '''
    Вычисляет площадь квадрата с заданной стороной а

    Параметры:
        а (float) - сторона квадрата

    Возращаемое значение:
        (float) - площадь квадрата

    Пример вызова функции:
        print(area(10))
        100
    '''

    return a * a



def perimeter(a):
    '''
    Вычисляет периметр квадрата с заданной стороной а

    Параметры:
        a (float) - сторона квадрата

    Возращаемое значение:
        (float) - периметр квадрата

    Пример вызова функции:
        print(perimeter(10))
        40
    '''
    return 4 * a


