
def area(a):
    ''' Находит площадь квадрата
            Параметры:
                a (double): сторона квадрата
            Возвращаемые значения:
                area (double): площадь квадрата
            Пример вызова функции: area(5) = 25
    '''
    return a * a


def perimeter(a):
    ''' Находит периметер квадрата
            Параметры:
                a (double): сторона квадрата
             Возвращаемые значения:
                perimeter (double): площадь квадрата
             Пример вызова функции: area(5) = 20
    '''
    return 4 * a
