
def square_area(a):
    return a ** 2
    '''
    Вычисляет площадь квадрата со сторой равной a.

            Параметры:
                    a (float): длина стороны квадрата;

            Возращаемое значение:
                    square_square (float): десятичное число, результат умножения a*a;
    '''


def square_perimeter(a):
    return 4 * a
    '''
    Вычисляет периметр квадрата со сторой равной a.

            Параметры:
                    a (float): длина стороны квадрата;

            Возращаемое значение:
                    square_perimeter (float): десятичное число, результат умножения 4*a;
    '''
