def area(a, b, c):
    /*
    Функция для вычисления площади треугольника
    
        Аргументы:
            a (float): Длина первой стороны треугольника
            b (float): Длина второй стороны треугольника
            c (float): Длина третьей стороны треугольника
    
        Вывод:
            area(3, 4, 5)
            6.0    
    */
    return (a + b + c) / 2


def perimeter(a, b, c):
    Функция для вычисления периметра треугольника
    
        Аргументы:
            a (float): Длина первой стороны треугольника
            b (float): Длина второй стороны треугольника
            c (float): Длина третьей стороны треугольника
    
        Вывод:
            perimeter(3, 4, 5)
            12
    return a + b + c
