def area(a, h):
    '''
    Возвращает площадь треугольника с длиной основания a и высотой проведённой к основанию h

        Параметры:
            a (float): длина основания треугольника
            h (float): длина высоты треугольника проведённой к основанию

        Возвращаемое значение:
            (float): значение площади треугольника
    '''
    return a * h / 2
    
def perimeter(a, b, c):
    '''
    Возвращает площадь треугольника с длинами сторой a, b,с

        Параметры:
            a (float): длина первой стороны треугольника
            b (float): длина второй стороны треугольника
            c (float): длина третьей стороны треугольника

        Возвращаемое значение:
            (float): значение периметра треугольника
    '''
    return a + b + c

