def area(a, b, c):
    '''
    Вычисляет полупериметр треугольника с заданными сторонами

    Параметры:
        a (float) - сторона треугольника
        b (float) - сторона треугольника
        c (float) - сторона треугольника

    Возращаемое значение:
        (float) - полупериметр треугольника

    Пример вызова:
        print(area(10, 10, 10))
        15.0
    '''

    return (a + b + c) / 2



def perimeter(a, b, c):
    '''
    Вычисляет периметр треугольника

    Параметры:
        a (float) - сторона треугольника
        b (float) - сторона треугольника
        c (float) - сторона треугольника

    Возращаемое значение:
        (float) - периметр треугольника

    Пример вызова:
        print(area(10, 10, 10))
        30
    '''

    return a + b + c















