
def triangle_area(a, h):
    return (a * h) / 2
    '''
    Вычисляет площадь треугольника со сторой равной a и высотой, проведенной к этой стороне длины h.

            Параметры:
                    a (float): длина стороны треугольника;
                    h (float): длина высоты треугольника;

            Возращаемое значение:
                    triangle_square (float): десятичное число, результат умножения (a*h)/2;
    '''


def triangle_perimeter(a, b, c):
    return a + b + c
    '''
    Вычисляет периметр треугольника со сторой равной a.

            Параметры:
                    a (float): длина стороны треугольника;
                    b (float): длина стороны треугольника;
                    c (float): длина стороны треугольника;

            Возращаемое значение:
                    triangle_perimeter (float): десятичное число, результат сложения a + b + c;
    '''
